       01  CUSTOMER-RECORD.
           05  CUSTOMER-ID         PIC 9(7).
           05  CUSTOMER-NAME       PIC X(20).
           05  TRANSACTION-AMOUNT  PIC S9(7)V99 COMP-3.
           05  LAST-TRANSACTION-DT PIC X(10).
           05  ACCOUNT-STATUS      PIC 9(1).
